app/Http/Controllers/Auth/spatie/RolesController.php

select * from `roles` order by `id` desc limit 5 offset 0
select count(*) as aggregate from `roles`
---
    public function index(Request $request)
    {
        $roles = Role::orderBy('id', 'DESC')->paginate(5);

select `permissions`.*, `role_has_permissions`.`role_id` as `pivot_role_id`, `role_has_permissions`.`permission_id` as `pivot_permission_id` from `permissions` inner join `role_has_permissions` on `permissions`.`id` = `role_has_permissions`.`permission_id` where `role_has_permissions`.`role_id` = 1
select * from `permissions`
---
    public function edit(Role $role)
    {
        $role = $role;
        $rolePermissions = $role->permissions->pluck('name')->toArray();
        $permissions = Permission::get();