app/Http/Controllers/PostsController.php

    public function index()
    {
        $posts = Post::latest()->paginate(10);
---
select count(*) as aggregate from `posts`

    public function store(Request $request)
    {
        Post::create(array_merge($request->only('title', 'description', 'body'),[
            'user_id' => auth()->id()
        ]));
---
insert into `posts` (`title`, `description`, `body`, `user_id`, `updated_at`, `created_at`) values ('Menghitung', 'hitung', 'tung tung', 1, '2023-01-03 02:02:10', '2023-01-03 02:02:10')