app/Http/Controllers/UsersController.php

    public function index()
    {
        $users = User::latest()->paginate(10);
---
select * from `users` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `users`