app/Http/Controllers/Admin/PermissionsController.php

    public function index()
    {
        $permissions = Permission::all();
---
select * from `permissions`