app/Http/Controllers/Admin/RolesController.php

select * from `roles` order by `id` desc limit 5 offset 0
select count(*) as aggregate from `roles`
---
    public function index(Request $request)
    {
        $roles = Role::orderBy('id', 'DESC')->paginate(5);