app/Http/Controllers/Admin/UsersController.php

select * from `users` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `users`
---
    public function index()
    {
        $users = User::latest()->paginate(10);

insert into `users` (`name`, `email`, `username`, `password`, `updated_at`, `created_at`) values ('a', 'a@gmail.com', 'aa', '$2y$10$VBPr6RbtnzHiATW6NIY0gOll/Ob4sFP.70BBfvQtn9F4O6.g5UdPW', '2023-01-03 06:26:33', '2023-01-03 06:26:33')
---
    public function store(User $user, StoreUserRequest $request)
    {
        //For demo purposes only. When creating user or inviting a user
        // you should create a generated random password and email it to the user
        $user->create(array_merge($request->validated(), [
            'password' => $request->password
        ]));